request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:calc="http://solvosoftjavatest" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ">
    <soapenv:Header/>
    <soapenv:Body>
        <calc:calculateRequest>
            <calc:input>1</calc:input>
            <calc:input>+</calc:input>
            <calc:input>2</calc:input>
        </calc:calculateRequest>
    </soapenv:Body>
</soapenv:Envelope>